# -*- coding:utf-8 -*-
""""""
"""
-------------------------------------------------运算符-------------------------------------------------
一、算术运算符
// :地板除（只保留整数部分）
% :取余数/取模

二、赋值运算符
1、增量赋值：+=、*=、/=等

2、链式赋值
    x = y = z = 10

3、交叉赋值
    m = 10 ; n = 20 ; m, n = n, m

4、解压赋值
    salaries = [111, 222, 333, 444, 555]
    mon0, mon1, mon2, mon3, mon4 = salaries

    salaries = [111, 222, 333, 444, 555]
    mon0, mon1, *mon_ = salaries        # *会将没有对应关系的值存成列表赋值给紧跟其后的变量名
    print(mon_)


-------------------------------------------------可变不可变类型-------------------------------------------------
一、定义
1、可变类型：变量值改变，但是id不变，说明改变的是原值，证明原值是可以被改变的
2、不可变类型：变量值改变，同时id也改变，说明是产生了新的值，证明原值是不可以改变的

二、验证
1、整型int、浮点型float、字符串string是不可分割的整体，是不可变类型
    x = 10 ; print(id(x))
    x = 11 ; print(id(y))

2、列表list、字典dict是可变类型
    l1 = ['aaa', 'bbb', 'ccc'] ; print(l1)
    l1[1] = 'ddd' ; print(l1)


-------------------------------------------------逻辑运算符-------------------------------------------------
一、显式布尔值
1、明确的True、False

二、隐式布尔值
1、除0, None, 空(空列表、空字符串、空字典)以外，所有的数据类型都为真

三、逻辑运算符not、and、or
1、not
(1) 把紧跟其后的条件取反
(2) not和紧跟其后的那个条件是不可分割的整体

2、not、and、or的优先级：not > and > or


-------------------------------------------------成员运算符和身份运算符-------------------------------------------------
一、成员运算符 in
1、字符串：判断子字符串是否存在原字符串中
2、列表：判断元素
2、字典：判断字典的键key

二、身份运算符 is
1、判断id是否相等，id相等，值一定相等



"""






